def category(c):
    # 1. 한식
    if c in ['삼계탕', '본죽', '본죽&비빔밥cafe', '한정식', '쌈밥', '곱창,막창', '족발,보쌈', '경복궁', '냉면', '해장국', '해물,생선', '퓨전한식', '마왕족발', '곰탕', '추어', '담소소사골순대육개장', '설렁탕', '전주현대옥', '실내포장마차', '국밥', '찌개,전골', '조개', '가장맛있는족발', '감자탕', '복어', '국수', '한식', '닭요리', '오리', '소호정']:
        return 1
    # 2. 일식
    elif c in ['일식집', '참치회', '퓨전일식', '샤브샤브', '초밥,롤', '돈까스,우동', '일본식라면', '회', '게,대게', '철판요리', '오뎅바', '장어', '채선당', '일식']:
        return 2
    # 3. 중식
    elif c in ['중식', '중국요리', '양꼬치', '퓨전중식', '홍짜장']:
        return 3
    # 4. 양식
    elif c in ['멕시칸,브라질', '양식', '이탈리안', '매드포갈릭', '빕스', '아웃백스테이크하우스', '스테이크,립']:
        return 4
    # 5. 분식
    elif c in ['청년다방', '순대', '분식', '고봉민김밥인', '영심이떡볶이&김밥', '동대문엽기떡볶이', '떡볶이']:
        return 5
    # 6. 피자
    elif c in ['도미노피자', '피자', '피자헛', ]:
        return 6
    # 7. 치킨
    elif c in ['푸라닭치킨', 'BHC치킨', 'BBQ', '깐부치킨', '교촌치킨', '치킨', '바른치킨', '60계']:
        return 7
    # 8. 고기
    elif c in ['송추가마골', '고반식당', '육류,고기', '고기뷔페', '삼겹살', '원조부안집', '갈비']:
        return 8
    # 9. 아시안
    elif c in ['동남아음식', '태국음식', '아시아음식', '생어거스틴', '베트남음식', '인도음식', '에머이']:
        return 9
    # 10. 술집
    elif c in ['칵테일바', '술집', '역전할머니맥주', '일본식주점', '와인바', '생활맥주', '모로미', '호프,요리주점']:
        return 10
    # 11. 카페
    elif c in ['커피빈', '투썸플레이스', '제과,베이커리', '한스', '까페라리', '파리크라상', '스타벅스', '롤링핀', '에그드랍', '디저트카페', '아이스크림', '이디야커피', '파스쿠찌', '메가MGC커피', '도넛', '떡,한과', '빽다방', '공차', '카페', '파리바게뜨', '다방', '할리스', '커피전문점', '배스킨라빈스', '뚜레쥬르', '아티제', '이삭토스트', '카페마마스', '하겐다즈']:
        return 11
    # 12. 패스트푸드
    elif c in ['맥도날드', '버거킹', '햄버거', '맘스터치', '쉐이크쉑', '써브웨이']:
        return 12
    # 13. 기타
    else:
        return 13
    
    